In [5]:
from pydbgen import pydb

In [10]:
myDB=pydb()

In [11]:
for _ in range(10):
    print(myDB.simple_ph_num())

957-606-6855
459-956-6002
423-086-3710
170-016-2656
186-387-9849
543-881-7240
685-382-1489
799-752-4786
426-993-2188
381-956-5413

In [12]:
for _ in range(10):
    print(myDB.license_plate())

JCI-008
1SCJ671
DWD-7325
EED-0979
4ABD316
5FKT745
JTR-299
ORD-967
5LSW171
8CFX992

In [13]:
for _ in range(10):
    print(myDB.realistic_email('Tirtha Sarkar'))

Sarkar_Tirtha@hotmail.com
Sarkar.Tirtha@gmail.com
Tirtha.Sarkar@protonmail.com
TSarkar@outlook.com
Tirtha.S44@aol.com
Tirtha.Sarkar@aol.com
TirthaSarkar@protonmail.com
Tirtha_Sarkar63@aol.com
TSarkar41@xfinity.com
Sarkar.Tirtha@yandex.com

In [14]:
for _ in range(10):
    print(myDB.city_real())

Morrisville
Larson
Keltys
Roads End
Andrews
Grand Chenier
Lake Katrine
North Johns
Kimballton
Kelloggsville

In [15]:
se=myDB.gen_data_series(num=5)
print(se)

0       Jordan Turner
1          Troy Young
2    Anthony Jennings
3        Kathy Carter
4           Kyle Bell
dtype: object

In [16]:
se=myDB.gen_data_series(num=-2)
print(se)

Please input a positive integer for the number of examples
None

In [17]:
se=myDB.gen_data_series(num=2.3)
print(se)

0    Steven Freeman
1    Michael Macias
dtype: object

In [18]:
se=myDB.gen_data_series(num=-2.3)
print(se)

Please input a positive integer for the number of examples
None

In [19]:
se=myDB.gen_data_series(num='hello')
print(se)

Number of samples not understood, terminating...
None

In [20]:
se=myDB.gen_data_series(num=[2,3])
print(se)

Number of samples not understood, terminating...
None

In [21]:
se=myDB.gen_data_series(data_type='date')
print(se)

0    2016-04-03
1    1998-11-09
2    1970-10-09
3    1985-09-17
4    1989-10-08
5    1990-05-26
6    1983-12-25
7    2015-05-07
8    1992-03-06
9    2010-11-21
dtype: object

In [22]:
se=myDB.gen_data_series(data_type=12)
print(se)

Data type not understood. No series generated
None

In [23]:
testdf=myDB.gen_dataframe(fields=['name','ssn','job_title'])
testdf

                  name          ssn                   job_title
0       Thomas Roberts  491-35-1897                Retail buyer
1         Robert Davis  460-65-6950                    Best boy
2     Leonard Gonzales  506-79-0766       Glass blower/designer
3        Amanda Miller  589-66-4009  Further education lecturer
4       Michelle Young  334-93-3411         Trade mark attorney
5         James Deleon  224-73-7945         Pensions consultant
6         Paige Miller  046-16-6923             Games developer
7           Brian Hahn  579-96-9488         Scientist, forensic
8  Elizabeth Castaneda  651-25-2731                TEFL teacher
9       Allison Garcia  334-65-3066   Psychologist, counselling

In [25]:
testdf=myDB.gen_dataframe(-4,fields=['name','email','city'])
testdf

Please input a positive integer for the number of examples

In [26]:
testdf=myDB.gen_dataframe('5',fields=['name','email','city'])
testdf

                name                      email        city
0      Roger Stanley  Stanley_Roger@comcast.net  Geigertown
1        Jared Ellis    Jared.Ellis@xfinity.com       Houma
2    Zachary Wallace      Zachary.W@comcast.net      Perrin
3  Marissa Maldonado      Marissa.M93@gmail.com      Starks
4       Bryan Newman        BNewman@hotmail.com    New Post

In [27]:
myDB.gen_table(20,fields=['name','city','job_title','phone','company'],
          db_file='TestDB.db',table_name='People')

In [28]:
myDB.gen_excel(15,fields=['name','year','email','license_plate'],filename='TestExcel.xlsx')

In [32]:
myDB.gen_table(20,fields=['name','age', 'city','job_title','phone','company'],
          db_file='TestDB.db',table_name='People', primarykey='age')

OperationalError: no such column: None

In [30]:
myDB.gen_table(20,fields=['name','city','job_title','phone','company'],
          db_file='TestDB.db',table_name='People', primarykey=12)

Primary key type not identified. Not generating any table

In [31]:
myDB.gen_table(20,fields=['name','city','job_title','phone','company','email'],
          db_file='TestDB.db',table_name='People', primarykey='city',real_city=True,real_email=False,phone_simple=False)